// Вам необходимо создать навигационное меню для веб-сайта, в котором меняется активный пункт при клике без фактического перехода на другие страницы. Меню должно обладать следующими характеристиками:
// Подсветка активного пункта: При клике на пункт меню он должен становиться активным, и для активного пункта должен применяться определенный стиль (например, изменение цвета фона). Если выбрать другой пункт, предыдущий должен перестать быть активным.
// Эффекты наведения: При наведении курсора на пункты меню должны применяться эффекты (например, изменение цвета текста или фона) для подсказки пользователю, что пункт меню является интерактивным.

const menu = document.querySelector('.nav');

menu.addEventListener('click', (e) => {
  if (!e.target.classList.contains('nav__link')) return;
  e.preventDefault();
  document.querySelectorAll('.nav__link').forEach(el => el.classList.remove('active'));
  e.target.classList.add('active');
})